<a href="https://colab.research.google.com/github/Sateesh110/Rep_ML/blob/master/zFE_Unique_Values.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# FE

## Import Packages

In [1]:
import numpy as np
import pandas as pd

##Source Data

In [ ]:
data = pd.read_csv('https://www.openml.org/data/get_csv/16826755/phpMYEkMl')
data.head(3)

   pclass  survived  ... body                        home.dest
0       1         1  ...    ?                     St Louis, MO
1       1         1  ...    ?  Montreal, PQ / Chesterville, ON
2       1         0  ...    ?  Montreal, PQ / Chesterville, ON

[3 rows x 14 columns]

## String Replace

In [ ]:
df = data.replace("?",np.nan)
df2 = df.copy()
df.head(3)

   pclass  survived  ... body                        home.dest
0       1         1  ...  NaN                     St Louis, MO
1       1         1  ...  NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...  NaN  Montreal, PQ / Chesterville, ON

[3 rows x 14 columns]

## Column Extract

In [ ]:
def get_first_cabin(row):
    try:
        return row.split()[0]
    except:
        return np.nan

In [ ]:
df['cabin'] = df['cabin'].apply(get_first_cabin)
df.head(3)

   pclass  survived  ... body                        home.dest
0       1         1  ...  NaN                     St Louis, MO
1       1         1  ...  NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...  NaN  Montreal, PQ / Chesterville, ON

[3 rows x 14 columns]